In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {"names": ["Kilho", "Kilho", "Kilho", "Charles", "Charles"],
           "year": [2014, 2015, 2016, 2015, 2016],
           "points": [1.5, 1.7, 3.6, 2.4, 2.9]}
df = pd.DataFrame(data, columns=["year", "names", "points", "penalty"],
                          index=["one", "two", "three", "four", "five"])

In [3]:
df

       year    names  points penalty
one    2014    Kilho     1.5     NaN
two    2015    Kilho     1.7     NaN
three  2016    Kilho     3.6     NaN
four   2015  Charles     2.4     NaN
five   2016  Charles     2.9     NaN

In [4]:
df["year"]

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [5]:
df.index.year("dk")

AttributeError: 'Index' object has no attribute 'year'

In [6]:
df.year

one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [7]:
df.year.points

AttributeError: 'Series' object has no attribute 'points'

In [8]:
df[["year","points"]]

       year  points
one    2014     1.5
two    2015     1.7
three  2016     3.6
four   2015     2.4
five   2016     2.9

In [9]:
df.penalty = 0.5

In [10]:
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.5
two    2015    Kilho     1.7      0.5
three  2016    Kilho     3.6      0.5
four   2015  Charles     2.4      0.5
five   2016  Charles     2.9      0.5

In [11]:
df["penalty"] = [0.1,0.2,0.3,0.4,0.5]

In [12]:
df

       year    names  points  penalty
one    2014    Kilho     1.5      0.1
two    2015    Kilho     1.7      0.2
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

In [13]:
df["zeros"]=np.arange(5)

In [14]:
df

       year    names  points  penalty  zeros
one    2014    Kilho     1.5      0.1      0
two    2015    Kilho     1.7      0.2      1
three  2016    Kilho     3.6      0.3      2
four   2015  Charles     2.4      0.4      3
five   2016  Charles     2.9      0.5      4

In [15]:
df["hoho"] = 0

In [16]:
df

       year    names  points  penalty  zeros  hoho
one    2014    Kilho     1.5      0.1      0     0
two    2015    Kilho     1.7      0.2      1     0
three  2016    Kilho     3.6      0.3      2     0
four   2015  Charles     2.4      0.4      3     0
five   2016  Charles     2.9      0.5      4     0

In [19]:
val = pd.Series([-1.2, -1.5, -1.7], index=["two", "four", "five"])
df["debt"] = val

In [20]:
df

       year    names  points  penalty  zeros  hoho  debt
one    2014    Kilho     1.5      0.1      0     0   NaN
two    2015    Kilho     1.7      0.2      1     0  -1.2
three  2016    Kilho     3.6      0.3      2     0   NaN
four   2015  Charles     2.4      0.4      3     0  -1.5
five   2016  Charles     2.9      0.5      4     0  -1.7

In [21]:
df["net_points"] = df["points"] - df["penalty"]

In [22]:
df["high_points"] = df["net_points"] >2.0

In [23]:
df

,year,names,points,penalty,zeros,hoho,debt,net_points,high_points
one,2014,Kilho,1.5,0.1,0,0,NaN,1.4,False
two,2015,Kilho,1.7,0.2,1,0,-1.2,1.5,False
three,2016,Kilho,3.6,0.3,2,0,NaN,3.3,True
four,2015,Charles,2.4,0.4,3,0,-1.5,2.0,False
five,2016,Charles,2.9,0.5,4,0,-1.7,2.4,True

In [26]:
del df["high_points"]

In [28]:
del df["hoho"]

In [29]:
del df["net_points"]

In [32]:
df.columns

Index(['year', 'names', 'points', 'penalty', 'zeros', 'debt'], dtype='object')

In [33]:
df.indexs

AttributeError: 'DataFrame' object has no attribute 'indexs'

In [34]:
df.index

Index(['one', 'two', 'three', 'four', 'five'], dtype='object')

In [35]:
df.index.name = "Order"

In [36]:
df.columns.name = "Info"

In [37]:
df

Info   year    names  points  penalty  zeros  debt
Order
one    2014    Kilho     1.5      0.1      0   NaN
two    2015    Kilho     1.7      0.2      1  -1.2
three  2016    Kilho     3.6      0.3      2   NaN
four   2015  Charles     2.4      0.4      3  -1.5
five   2016  Charles     2.9      0.5      4  -1.7

In [38]:
df[0:3]

Info   year  names  points  penalty  zeros  debt
Order
one    2014  Kilho     1.5      0.1      0   NaN
two    2015  Kilho     1.7      0.2      1  -1.2
three  2016  Kilho     3.6      0.3      2   NaN

In [39]:
df["two":"four"]

Info   year    names  points  penalty  zeros  debt
Order
two    2015    Kilho     1.7      0.2      1  -1.2
three  2016    Kilho     3.6      0.3      2   NaN
four   2015  Charles     2.4      0.4      3  -1.5

In [40]:
df.loc["two"]

Info
year        2015
names      Kilho
points       1.7
penalty      0.2
zeros          1
debt        -1.2
Name: two, dtype: object

In [44]:
df.loc["two":"four","points"]

Order
two      1.7
three    3.6
four     2.4
Name: points, dtype: float64

In [45]:
df.loc[:,"year"]

Order
one      2014
two      2015
three    2016
four     2015
five     2016
Name: year, dtype: int64

In [46]:
df.loc[:,["year","names"]]

Info   year    names
Order
one    2014    Kilho
two    2015    Kilho
three  2016    Kilho
four   2015  Charles
five   2016  Charles

In [48]:
df.loc["three":"five","year":"penalty"]

Info   year    names  points  penalty
Order
three  2016    Kilho     3.6      0.3
four   2015  Charles     2.4      0.4
five   2016  Charles     2.9      0.5

In [51]:
df.loc["six",:] = [2013,"hansoo",4.0,0.1,2.1,6.5]

In [50]:
df

Info     year    names  points  penalty  zeros  debt
Order
one    2014.0    Kilho     1.5      0.1    0.0   NaN
two    2015.0    Kilho     1.7      0.2    1.0  -1.2
three  2016.0    Kilho     3.6      0.3    2.0   NaN
four   2015.0  Charles     2.4      0.4    3.0  -1.5
five   2016.0  Charles     2.9      0.5    4.0  -1.7
six       NaN      NaN     NaN      NaN    NaN   NaN

In [52]:
df

Info     year    names  points  penalty  zeros  debt
Order
one    2014.0    Kilho     1.5      0.1    0.0   NaN
two    2015.0    Kilho     1.7      0.2    1.0  -1.2
three  2016.0    Kilho     3.6      0.3    2.0   NaN
four   2015.0  Charles     2.4      0.4    3.0  -1.5
five   2016.0  Charles     2.9      0.5    4.0  -1.7
six    2013.0   hansoo     4.0      0.1    2.1   6.5

In [53]:
df.iloc[3]

Info
year          2015
names      Charles
points         2.4
penalty        0.4
zeros            3
debt          -1.5
Name: four, dtype: object

In [54]:
df.iloc[:,1:4]

Info     names  points  penalty
Order
one      Kilho     1.5      0.1
two      Kilho     1.7      0.2
three    Kilho     3.6      0.3
four   Charles     2.4      0.4
five   Charles     2.9      0.5
six     hansoo     4.0      0.1

In [55]:
df.iloc[1,1]

'Kilho'

In [56]:
df

Info     year    names  points  penalty  zeros  debt
Order
one    2014.0    Kilho     1.5      0.1    0.0   NaN
two    2015.0    Kilho     1.7      0.2    1.0  -1.2
three  2016.0    Kilho     3.6      0.3    2.0   NaN
four   2015.0  Charles     2.4      0.4    3.0  -1.5
five   2016.0  Charles     2.9      0.5    4.0  -1.7
six    2013.0   hansoo     4.0      0.1    2.1   6.5

In [57]:
del df.zeros

AttributeError: zeros

In [58]:
del df["zeros"]

In [59]:
df

Info     year    names  points  penalty  debt
Order
one    2014.0    Kilho     1.5      0.1   NaN
two    2015.0    Kilho     1.7      0.2  -1.2
three  2016.0    Kilho     3.6      0.3   NaN
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7
six    2013.0   hansoo     4.0      0.1   6.5

In [60]:
df["year"] >2014

Order
one      False
two       True
three     True
four      True
five      True
six      False
Name: year, dtype: bool

In [61]:
df.loc[df["year"]>2014,:]

Info     year    names  points  penalty  debt
Order
two    2015.0    Kilho     1.7      0.2  -1.2
three  2016.0    Kilho     3.6      0.3   NaN
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7

In [63]:
df.loc[df["names"]=="Kilho", ["names","points"]]

Info   names  points
Order
one    Kilho     1.5
two    Kilho     1.7
three  Kilho     3.6

In [64]:
df.loc[(df["points"]>2) & (df["points"]<3),:]

Info     year    names  points  penalty  debt
Order
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7

In [65]:
df.loc[df["points"]>3, "penalty"] = 0

In [66]:
df

Info     year    names  points  penalty  debt
Order
one    2014.0    Kilho     1.5      0.1   NaN
two    2015.0    Kilho     1.7      0.2  -1.2
three  2016.0    Kilho     3.6      0.0   NaN
four   2015.0  Charles     2.4      0.4  -1.5
five   2016.0  Charles     2.9      0.5  -1.7
six    2013.0   hansoo     4.0      0.0   6.5

In [67]:
import numpy as np
import pandas as pd

In [68]:
df = pd.DataFrame(np.random.randn(6,4))

In [69]:
df

          0         1         2         3
0  0.307186  0.481070  0.395568 -0.191160
1 -0.374560  0.054174 -1.180604 -1.861282
2  1.825710  0.791469 -1.452319  1.685154
3 -1.094438 -0.599917  0.424141 -0.728854
4 -1.030433 -0.840255  1.044099 -2.189800
5  2.446348 -0.438886 -0.824953  1.719785

In [73]:
df.columns = ["A","B","C","D"]
df.index = pd.date_range("20160701",periods=6)
# date_range

In [72]:
df.index

DatetimeIndex(['2016-07-01', '2016-07-02', '2016-07-03', '2016-07-04',
               '2016-07-05', '2016-07-06'],
              dtype='datetime64[ns]', freq='D')

In [74]:
df["F"]=[1.0, np.nan, 3.5, 6.1, np.nan, 7.0]

In [75]:
df

                   A         B         C         D    F
2016-07-01  0.307186  0.481070  0.395568 -0.191160  1.0
2016-07-02 -0.374560  0.054174 -1.180604 -1.861282  NaN
2016-07-03  1.825710  0.791469 -1.452319  1.685154  3.5
2016-07-04 -1.094438 -0.599917  0.424141 -0.728854  6.1
2016-07-05 -1.030433 -0.840255  1.044099 -2.189800  NaN
2016-07-06  2.446348 -0.438886 -0.824953  1.719785  7.0

In [79]:
df.dropna(how="any")
#nan     
df.dropna(how="all")
# nan

                   A         B         C         D    F
2016-07-01  0.307186  0.481070  0.395568 -0.191160  1.0
2016-07-02 -0.374560  0.054174 -1.180604 -1.861282  NaN
2016-07-03  1.825710  0.791469 -1.452319  1.685154  3.5
2016-07-04 -1.094438 -0.599917  0.424141 -0.728854  6.1
2016-07-05 -1.030433 -0.840255  1.044099 -2.189800  NaN
2016-07-06  2.446348 -0.438886 -0.824953  1.719785  7.0

In [81]:
df.fillna(value=5.0)
#nan 5.0

                   A         B         C         D    F
2016-07-01  0.307186  0.481070  0.395568 -0.191160  1.0
2016-07-02 -0.374560  0.054174 -1.180604 -1.861282  5.0
2016-07-03  1.825710  0.791469 -1.452319  1.685154  3.5
2016-07-04 -1.094438 -0.599917  0.424141 -0.728854  6.1
2016-07-05 -1.030433 -0.840255  1.044099 -2.189800  5.0
2016-07-06  2.446348 -0.438886 -0.824953  1.719785  7.0

In [84]:
df.isnull()
#nan   true

                A      B      C      D      F
2016-07-01  False  False  False  False  False
2016-07-02  False  False  False  False   True
2016-07-03  False  False  False  False  False
2016-07-04  False  False  False  False  False
2016-07-05  False  False  False  False   True
2016-07-06  False  False  False  False  False

In [85]:
df.loc[df.isnull()["F"],:]

                   A         B         C         D   F
2016-07-02 -0.374560  0.054174 -1.180604 -1.861282 NaN
2016-07-05 -1.030433 -0.840255  1.044099 -2.189800 NaN

In [87]:
pd.to_datetime("20160701")

Timestamp('2016-07-01 00:00:00')

In [88]:
df.drop(pd.to_datetime("20160701"))

                   A         B         C         D    F
2016-07-02 -0.374560  0.054174 -1.180604 -1.861282  NaN
2016-07-03  1.825710  0.791469 -1.452319  1.685154  3.5
2016-07-04 -1.094438 -0.599917  0.424141 -0.728854  6.1
2016-07-05 -1.030433 -0.840255  1.044099 -2.189800  NaN
2016-07-06  2.446348 -0.438886 -0.824953  1.719785  7.0

In [89]:
df.drop([pd.to_datetime("20160702"),pd.to_datetime("20160704")])

                   A         B         C         D    F
2016-07-01  0.307186  0.481070  0.395568 -0.191160  1.0
2016-07-03  1.825710  0.791469 -1.452319  1.685154  3.5
2016-07-05 -1.030433 -0.840255  1.044099 -2.189800  NaN
2016-07-06  2.446348 -0.438886 -0.824953  1.719785  7.0

In [90]:
df.drop("F",axis=1)

                   A         B         C         D
2016-07-01  0.307186  0.481070  0.395568 -0.191160
2016-07-02 -0.374560  0.054174 -1.180604 -1.861282
2016-07-03  1.825710  0.791469 -1.452319  1.685154
2016-07-04 -1.094438 -0.599917  0.424141 -0.728854
2016-07-05 -1.030433 -0.840255  1.044099 -2.189800
2016-07-06  2.446348 -0.438886 -0.824953  1.719785

In [93]:
df.drop(["B","D"], axis=1)

                   A         C    F
2016-07-01  0.307186  0.395568  1.0
2016-07-02 -0.374560 -1.180604  NaN
2016-07-03  1.825710 -1.452319  3.5
2016-07-04 -1.094438  0.424141  6.1
2016-07-05 -1.030433  1.044099  NaN
2016-07-06  2.446348 -0.824953  7.0

In [94]:
df

                   A         B         C         D    F
2016-07-01  0.307186  0.481070  0.395568 -0.191160  1.0
2016-07-02 -0.374560  0.054174 -1.180604 -1.861282  NaN
2016-07-03  1.825710  0.791469 -1.452319  1.685154  3.5
2016-07-04 -1.094438 -0.599917  0.424141 -0.728854  6.1
2016-07-05 -1.030433 -0.840255  1.044099 -2.189800  NaN
2016-07-06  2.446348 -0.438886 -0.824953  1.719785  7.0